nbd_fio_results/dev-nbd0_2023-07-17_12:43/seq_r_nbd0_16iodepth/4096.txt
read: (g=0): rw=read, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 thread
fio: cache invalidation of /dev/nbd0 failed: Permission denied

read: (groupid=0, jobs=1): err= 0: pid=18453: Mon Jul 17 12:55:14 2023
   read: IOPS=333, BW=1335MiB/s (1400MB/s)(26.1GiB/20022msec)
    slat (usec): min=1104, max=3383, avg=2981.92, stdev=173.49
    clat (usec): min=20883, max=62533, avg=44913.73, stdev=839.31
     lat (usec): min=24019, max=65591, avg=47897.23, stdev=870.74
    clat percentiles (usec):
     |  1.00th=[44303],  5.00th=[44303], 10.00th=[44303], 20.00th=[44827],
     | 30.00th=[44827], 40.00th=[44827], 50.00th=[44827], 60.00th=[44827],
     | 70.00th=[45351], 80.00th=[45351], 90.00th=[45351], 95.00th=[45351],
     | 99.00th=[45876], 99.50th=[45876], 99.90th=[47449], 99.95th=[53216],
     | 99.99th=[62653]
   bw (  MiB/s): min= 1248, max= 1344, per=99.87%, avg=1333.33, stdev=14.46, samples=40
   iops        : min=  312, max=  336, avg=333.32, stdev= 3.62, samples=40
  lat (msec)   : 50=99.93%, 100=0.07%
  cpu          : usr=0.09%, sys=3.78%, ctx=180176, majf=0, minf=35
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.8%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6683,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1335MiB/s (1400MB/s), 1335MiB/s-1335MiB/s (1400MB/s-1400MB/s), io=26.1GiB (28.0GB), run=20022-20022msec

Disk stats (read/write):
  nbd0: ios=212396/0, merge=0/0, ticks=5011468/0, in_queue=2523447, util=99.55%